@extends('layouts.app')

@section('title')
انواع اسلات توسعه و تفاوت آن‌ها
@endsection

@section('description')

@endsection

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-sm-3">
                @include('includes.tutorial_side_nav')
            </div>
            
            <div class="col-sm-9 page-content">
                <h3>هسته‌های پردازنده (CPU Cores)</h3>
                <p>
                        هسته‌ها (cores) در پردازنده‌ها همانند یک <a href="">پردازنده</a> مستقل عمل می‌کنند بدین صورت که هر هسته می‌تواند به طور <b>همزمان و مستقل</b> از هسته دیگری عملیاتی را انجام دهد. برای مثال فرض کنید می‌خواهیم حاصل عبارت زیر را توسط پردازنده یک هسته‌ای و دو هسته‌ای بدست آوریم.
                </p>
                <p class="text-center">
                        <b>5 * 4 * 3 * 2 = ?</b>
                </p>
                <p>
                    در پردازنده یک هسته‌ای این عملیات به صورت زیر در<b> ۳ مرحله</b> انحام می‌شود.
                </p>
                <img class="img-responsive" alt="انجام یک عملیات ساده ریاضی در پردازنده تک هسته‌ای" style="max-width:500px;" src="/images/md/cpu/عملیات-پردازنده-تک-هسته‌ای.jpg">
                <p>
                        اما در پردازنده‌ی دو هسته‌ای پس از <b>دو مرحله</b> حاصل عبارت بدست می‌آید.
                </p>
                <img class="img-responsive" alt="انجام یک عملیات ساده ریاضی در پردازنده دو هسته‌ای" style="max-width:500px;" src="/images/md/cpu/عملیات-پردازنده-دو-هسته‌ای.jpg">
                <p>
                        پردازنده‌های چند هسته‌ای در برنامه‌های که قابلیت <b>تقسیم عملیات‌ها</b> به چند قسمت (رشته یا thread) را دارند باعث <b>افزایش سرعت اجرای</b> برنامه‌ها می‌شود. از انواع این برنامه‌ها (چند رشته‌ای) میتوان به برنامه‌های ویرایش ویدیو، رمزگشایی و فشرده‌سازی فایل‌ها اشاره کرد.
                </p>
                <h4>آیا پردازنده‌های چند هسته‌ای باعث افزایش سرعت بازی‌ها می‌شوند؟</h4>
                <p>
                        همانطور که می‌دانید <a href="">GPU</a> وظیفه‌ی پردازش تصاویر در کارت گرافیک را برعهده دارد. و CPU وظایفی از قبیل کنترل هوش مصنوعی بازی، واکنش نسبت به ورودی‌های بازی (کنترلر‌های بازی) و کنترل اعمال GPU را بر عهده دارد. با توجه به <b>پیچیدگی زیاد</b> این اعمال و وابستگی اعمال به <b>ترتیب انجام عملیات‌ها</b> (برخلاف مثال ذکر شده‌ی ضرب چند عدد)، تقسیم عملیات‌ها به چندین رشته <b>بسیار مشکل است</b> از این رو بیشتر بازی‌ها از قابلیت چند هسته‌ای پردازنده بهره نمی‌برند و این گونه پردازنده‌ها تاثیر چندانی در سرعت اجرای بازی ندارند.
                </p>
                {{--  related links  --}}
                <div id="related-links">
                    
                </div>
                 
                
            </div>
        </div>
    </div>
@endsection