@extends('layouts.app')

@section('title')
انواع اسلات توسعه و تفاوت آن‌ها
@endsection

@section('description')

@endsection

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-sm-3">
                @include('includes.tutorial_side_nav')
            </div>
            
            <div class="col-sm-9 page-content">
                <h3>فناوری چند رشته‌ای (Hyper-Threading) پردازنده</h3>
                <img class="img-responsive" alt="فناوری چند رشته‌ای پردازنده" style="width:90%;max-width:800px;" src="/images/md/cpu/فناوری-چند-رشته‌ای.jpg">
                <p>
                        فرض کنید دهان شما یک هسته (core) پردازنده می‌باشد و وظیفه‌ی پردازش (خوردن) غذا را برعهده دارد، و وقتی شما در حال جویدن یک غذا هستید امکان افزودن غذا وجود ندارد. حال اگر شما یک دست برای انتقال غذا داشته باشید ممکن است کار جویدن غذا تمام شود اما شما هنوز در حال جستجو برای لقمه (داده) بعدی باشید بدین صورت دهان شما (پردازنده) ‌<b>منتظر می‌ماند</b> و بازده آن کم می‌شود. حال فرض کنید به جای یک دست، چند دست (<b>رشته</b>) وظیفه‌ی <b>جستجو برای داده‌ی بعدی</b> را برعهده گیرند در این صورت همواره لقمه بعدی آماده است و شما منتظر لقمه بعدی نمی‌مانید.
                </p>
                <p>
                        به فناوری استفاده از چندین رشته (thread) برای یافتن و انتقال دستورالعمل‌ها به هسته‌ی پردازنده فناوری <b>چند رشته‌ای</b> (HT Technology) گفته می‌شود.
                </p>
                <p>
                        <span class="glyphicon glyphicon-alert"></span>فناوری چند رشته‌ای پردازنده تنها در <b>برنامه‌های چند رشته‌ایی</b> (multi-thread)، باعث افزایش سرعت پردازش دستورالعمل‌ها (سرعت پردازنده) می‌شود. در این این برنامه‌ها عملیات‌های مربوط به برنامه (process) به <b>چندین رشته</b> تقسییم می‌شوند که هر یک از این رشته‌ها به طور مستقل و هم زمان می‌توانند به وسیله‌ی پردازنده‌های مختلف و بدون تداخل با یکدیگر اجرا شوند. برنامه‌هایی نظیر ویرایش تصاویر و رندر سه بعدی تصاویر از انواع پر کاربرد برنامه‌های چند رشته‌ای هستند.
                </p>
                {{--  related links  --}}
                <div id="related-links">

                </div>
                 
                
            </div>
        </div>
    </div>
@endsection