@extends('layouts.app')

@section('title')
انواع اسلات توسعه و تفاوت آن‌ها
@endsection

@section('description')

@endsection

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-sm-3">
                @include('includes.tutorial_side_nav')
            </div>
            
            <div class="col-sm-9 page-content">
                <h3>فرم فاکتور ATX</h3>
                <p>
                    ATX مخفف عبارت Advanced Technology Extended است. این نوع فرم فاکتور مادربورد در سال ۱۹۹۵ توسط کمپانی اینتل عرضه شد.  و در حال حاضر <b>متداول‌ترین</b> نوع <a href="">مادربورد</a> می‌باشد.
                    بیشینه ابعاد فرم فاکتور ATX 305 در 244 میلی‌متر است. در این نوع مادربورد امکان نصب حداکثر <b>۷</b> <a href="">کارت توسعه</a> (expansion card) و یا <b>۴</b> کارت توسعه دوگانه (Dual) وجود دارد همچنین حداکثر <b>۸</b> اسلات رم (<a href="">Memory</a>) نیز موجود است.
                </p>
                <img alt="فرم فاکتور ATX" class="img-responsive" src="/images/md/motherboard/فرم-فاکتور-atx.jpg">
                <p>
                    در فرم فاکتور ATX اسلات‌های مموری پشت <a href="">پردازنده</a> و به صورت عمودی قرار گرفته و اسلات‌‌های توسعه در پایین آن و به صورت افقی واقع شده‌اند، این نحوه چینش از نواقص این نوع فرم فاکتور است چون باعث <b>اختلال در جریان هوا</b> می‌شود (البته با استفاده مناسب از <a href="">فن</a> <a herf="">کیس</a> می‌توان از این عیب چشم پوشی کرد). همچنین <a href="">پنل پشتی</a> این نوع مادربورد در قسمت <b>بالای</b> آن قرار گرفته شده است (در <a href="">BTX</a> در قسمت پایین است).
                </p>
                <img class="img-responsive" style="max-width: ;" alt="" src="/images/md/motherboard/.jpg">
                <p>
                    <span class="glyphicon glyphicon-hand-left"></span>نکته دیگری که باید هنگام خرید مادربورد به آن توجه کرد سازگاری مادربورد با <a href="">پاور</a> (Power Supply) است فرم فاکتور ATX کانکتور‌‌های پاور <a href="">۲۴ پین</a> و <a href="">۸ پین</a> را پشتیبانی می‌کند.
                </p>
                <h4>فرم فاکتور Micro ATX</h4>
                <p>
                    نمونه <b>کوچکتر</b> فرم فاکتور ATX می‌باشد. این نوع فرم فاکتور در <b>۲۴۴ در ۲۴۴</b> میلی‌متر عرضه می‌شوند و برای همه چیز که یک کاربر معمولی نیاز دارد در آن جا داده شده است.
                </p>
                <p>
                    فرم فاکتور Micro ATX دارای حداکثر <b>۴</b> اسلات توسعه و <b>۲ تا ۴</b> اسلات رم می‌باشد. همچنین کانکتور‌‌های پاور آن شامل یک کانکتور ۲۴ پین و یک کانکتور ۴ یا ۸ پین می‌باشد.
                </p>
                <h4>فرم فاکتور Mini ITX</h4>
                <p>
                        برخلاف فرم فاکتور‌های ATX که توسط کمپانی <a href="">اینتل</a> طراحی شده‌اند، Mini ITX توسط شرکت VIA Technologies طراحی و عرشه شده است. Mini ITX را می‌توان نمونه کوچکتر فرم فاکتور ATX نامید، که برای سیستم‌های <b>کم قدرت و کوچک</b> عرضه استفاده می‌شود. 
                </p>
                <p>
                        این نوع مادربورد دارای یک اسلات توسعه (اسلات دوگانه را نیز پشتیبانی می‌کند.) و دو اسلات مموری (حداکثر <b>۱۶ گیگابایت</b>) می‌باشد. همچنین پردازنده‌‌های نوع <a href="">Quad-core</a> را نیز پشتیبانی می‌کند.
                </p>
                <h4>فرم فاکتور Flex ATX </h4>
                <p>
                        در سال ۱۹۹۹ طراحی شده و دارای بیشینه ابعاد 299 در ۱۹۱ میلی‌متر است و از نظر طرح کاملا شبیه ATX است. در واقع این فرم فاکتور مدل کوچکتر Micro ATX می باشد.
                </p>
                <h4>فرم فاکتور E-ATX</h4>
                <p>
                        نمونه بزرگتر فرم فاکتور ATX با نام <b>Extended ATX</b> می باشد که پهنای آن 244 میلی‌متر و طول آن متغییر است. تفاوت این نوع فرم فکتور با ATX در عبارت‌اند از ...
                </p>
                <ul class="list-group">
                    <li class="list-group-item">جریان هوا در فرم فاکتور E-ATX بیشتر و بهتر است.</li>
                    <li class="list-group-item">تعداد بیشینه اسلات رم فرم فاکتور E-ATX بیشتر است (<b>دو برابر</b> ATX ).</li>
                    <li class="list-group-item">پنل پشتی بهتر E-ATA</li>
                    <li class="list-group-item">وجود پورت‌های <a href="">SAS</a></li>
                </ul>
                <a href="/images/xl/motherboard/مقایسه-انواع-فرم-فاکتور-atx.jpg" target="_blank">
                    <img class="img-responsive" title="برای مشاهده تصویر بزرگ کلیک کنید" style="max-width: 600px;" alt="‌‌مقایسه فرم فاکتور‌های ATX" style="max-width: 550px;" src="/images/md/motherboard/مقایسه-انواع-فرم-فاکتور-atx.jpg">
                </a>
                <h4>کیس من کدام فرم فاکتور را پشتیبانی می‌کند؟</h4>
                <p>
                        یکی از نکات مهم هنگام خرید مادربورد تطابق مادربورد با کیس می‌باشد، بعنوان یک راهنمایی کلی می‌توان گفت که کیس‌هایی که فرم فاکتور‌های بزرگ‌تر در خانواده ATX را پشتیبایی می‌کنند، قابلیت پشتیبانی از فرم‌فاکتور‌های کوچکتر ATX را نیز دارند.
                </p>
                <img class="img-responsive" alt="مقایسه اندازه فرم فاکتور‌های نوع ATX" style="max-width: 550px;" src="/images/md/motherboard/مقایسه-اندازه-فرم-فاکتور-atx.jpg">
                
                {{--  related links  --}}
                <div id="related-links">

                </div>
                 
                
            </div>
        </div>
    </div>
@endsection