@extends('layouts.app')

@section('title')
انواع اسلات توسعه و تفاوت آن‌ها
@endsection

@section('description')

@endsection

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-sm-3">
                @include('includes.tutorial_side_nav')
            </div>
            
            <div class="col-sm-9 page-content">
                 <h3>گذرگاه Firewire</h3>
                 <p>
                        Firewire، گذرگاهی است که برای اتصال وسایل اکسترنال مانند <b>دوربین‌ها و ویدیو‌های دیجیتال</b> به سیستم مورد استفاده قرار می‌گیرد. Firewire از استاندارد <b>IEEE 1394</b> استفاده می‌کند بنابرین در برخی موارد با این نام شناخته می‌شود.
                 </p>
                 <p>
                        گذرگاه Firewire شباهت زیادی به <a href="">USB</a> دارد. برای مثال هر دوی این گذرگاه‌ها ویژگی <a href="">hot plugging</a> و <a href="">PnP</a> را پشتیبانی کرده و <a href="">برق</a> مورد نیاز قطعات کم‌مصرف متصل به خود را تامین می‌کنند. البته شرکت سونی نسخه‌ای از Firewire به نام <b>i.Link</b> را در لپ‌تاپ‌های خود عرضه کرده که وسایل متصل برق مورد نیاز خود را از منبعی غیر از گذرگاه i.Link تامین می‌کنند. (هدف صرفه‌جویی در مصرف باتری لپ‌تاپ است)
                 </p>
                 <h4>استاندارد‌های Firewire</h4>
                 <p>
                        استاندارد‌ Firewire در <b>سه نسخه</b> عرضه شده است، که هر یک سرعت‌های مختلفی را پشتیبانی می‌کنند.
                 </p>
                 <ul class="custom-list">
                    <li><b>1394a</b> : این استاندارد دارای حالت‌های انتقال S100 با سرعت انتقال ۱۰۰ مگابایت بر ثانیه، S200 با سرعت انتقال ۲۰۰ مگابایت و S400 با سرعت اتقال ۴۰۰ مگابایت بر ثانیه است. بیشینه محدودیت کابل در این استاندارد ۴.۵ متر است. در این استاندارد از یک کانکتور <b>۴ پینی</b> در سمت کامپیوتر و یک کانکتور <b>۶ پینی</b> در سمت قطعه استفاده می‌شود.</li>
                    <img class="img-responsive" alt="کانکتور‌های ۴ پین و ۶ پین استاندارد 1394a firewire" style="max-width:320px;" src="/images/md/ports/کانکتور-۴پین-۶پین.jpg">
                    <li><b>1394b</b> : این استاندارد دارای حالت‌های انتقال S800 با سرعت انتقال ۸۰۰ مگابایت در ثانیه، S1600 با سرعت ۱۶۰۰ مگابایت و S3200 با سرعت انتقال ۳۲۰۰ مگابایت بر ثانیه است. در این استاندراد از کابل فیبرنوری پشتیبانی می‌شود، که بیشینه طول کابل را به ۱۰۰ متر افزایش می‌یابد. در این نوع استاندارد در سمت کامپیوتر و قطعه از یک کانکتور <b>۹ پینی</b> استفاده می‌شود.</li>
                    <img class="img-responsive" alt="کانکتور ۹ پین Firewire استاندارد 1394b" style="max-width:400px;" src="/images/md/ports/کانکتور-۹-پین-1394b.jpg">
                    <li><b>1394c</b> : این استاندارد تنها دارای حالت انتقال S800T با سرعت انتقال ۸۰۰ مگابایت در ثانیه است. و از کانکتور <b>RJ-45</b> و کابل CAT5e با بیشینه طول 100 متر استفاده می‌کند.</li>
                    <img class="img-responsive" alt="کانکتور RJ-45 استاندارد 1394c" style="max-width:400px;" src="/images/md/ports/کانکتور-rj-45.jpg">
                 </ul>
                 <h4>مزایای Firewire نسبت به USB</h4>
                 <p>
                        هر دو گذرگاه برای اتصال وسایل اکسترنال استفاده می‌شوند. USB به عنوان استاندارد در سیستم‌های <a href="">ATX</a> پشتیبانی شده است و امروزه در تمامی کامپیوتر‌ها وجود دارد حال آنکه Firewire بیشتر در <a href="">مادربورد</a>‌های <b>گران قیمت</b> استفاده می‌شود. دلیل استفاده از Firewire مزایای آن نسبت به USB می‌باشد.
                 </p>
                 <ul class="custom-list">
                    <li>در وسیله‌ی Firewire را می‌توان بدون اتصال به کامپیوتر <b>به طور مستقیم</b> به یکدیگر متصل کرد اما USB کاملا به سیستم وابسته است. (هر چند وسایل USB OTG این امکان Firewire را دارند)</li>
                    <li>Firewire از <b>شبکه</b> پشتیبانی می‌کند و می‌توان چندین کامپیوتر را به هم مرتبط و شبکه‌ی داده ایجاد کرد. (در USB هم این امکان به وسیله‌س نرم‌افزار‌های شبیه ساز وجود دارد اما کارایی آن کمتر است)</li>
                    <li>در USB، تامین برق با ولتاژ ۵ ولت است و توانی معادل ۲.۵ ولت را ارائه می‌دهد؛ در صورتی که تامین برق در Firewire با <b>ولتاژ ۱۲ تا ۲۵</b> ولت است (به طور خودکار با دستگاه مطابقت می‌یابد) و توانی معادل <b>۴۸ وات</b> را ارائه می‌دهد. از این رو Firewire می‌تواند برای تامین قطعات با مصرف برق بالاتر نیز استفاده شود.</li>
                 </ul>

                {{--  related links  --}}
                <div id="related-links">

                </div>
            </div>
        </div>
    </div>
@endsection