@extends('layouts.app')

@section('title')
انواع اسلات توسعه و تفاوت آن‌ها
@endsection

@section('description')

@endsection

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-sm-3">
                @include('includes.tutorial_side_nav')
            </div>
            
            <div class="col-sm-9 page-content">
                 <h3>کارت مودم</h3>
                 <p>
                        مودم یا  MODulator/DEModulator وسیله‌ای است که برای ارتباط بین کامپیوتر‌ها و شبکه‌ها بکار می‌رود. مودم‌ها برای ایجاد ارتباط از <b>خطوط معمولی تلفن</b> استفاده می‌کنند و سیگنال‌های صوتی آنالوگ را به داده‌های دیجیتال برای کامپیوتر تبدیل می‌کنند.
                 </p>
                 <p>
                        مودم‌ها به دو صورت اینترنال و اکسترنال عرضه می‌شوند. مودم‌های اینترنال یا کارت مودم به اسلات‌های توسعه و <a href="">مودم‌های اکسترنال</a> از طریق پورت‌های <a href="">USB</a>، <a href="">پورت سریال</a> و <a href="">Firewire</a> به سیستم متصل می‌شوند.
                 </p>
                 <a href="/images/xl/internet/اجزای-کارت-مودم.jpg">
                    <img class="img-responsive" alt="اجزای کارت مودم" title="برای مشاهده تصویر بزرگ کلیک کنید" style="max-width:600px;" src="/images/md/internet/اجزای-کارت-مودم.jpg">
                 </a>
                 <h4>پورت‌های کارت مودم</h4>
                 <p>
                        برخی از پورت‌هایی که در قسمت پشت کارت مودم وجود دارد عبارت است از:
                 </p>
                 <ul class="custom-list">
                    <li><b>Line</b> : این پورت از کانکتور <a href=""><b>RJ-11</b></a> استفاده می‌کند و برای اتصال مودم به خط تلفن به کار می‌رود.</li>
                    <li><b>Phone</b> : این پورت نیز از کانکتور <b>RJ-11</b> استفاده می‌کند و برای اتصال مودم به گوشی تلفن یا فکس بکار می‌رود. ممکن است در اتاق تنها یک پریز وجود داشته باشد که آن توسط مودم اشغال شده است. این پورت برای رفع این مشکل طراحی شده است.</li>
                    <li><b>بلندگو</b> : این پورت با کانکتور <a href=""><b>RCA mini-jack</b></a> برای ارسال صدای تماس‌های دریافتی به بلندگو یا هدفون بکار می‌رود.</li>
                    <li><b>میکروفن</b> : از کانکتور <b>RCA min-jack</b> استفاده می‌کند و برای ارسال صدا در هنگام مکالمه تلفنی مورد استفاده قرار می‌گیرد.</li>
                 </ul>
                {{--  related links  --}}
                <div id="related-links">

                </div>
            </div>
        </div>
    </div>
@endsection