@extends('layouts.app')

@section('title')
انواع اسلات توسعه و تفاوت آن‌ها
@endsection

@section('description')

@endsection

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-sm-3">
                @include('includes.tutorial_side_nav')
            </div>
            
            <div class="col-sm-9 page-content">
                <h3>نرخ بروزرسانی تصاویر (Refresh Rate)</h3>
                <img class="img-responsive" alt="تاثیر نرخ بروزرسانی تصاویر در بازی" style="max-width:550px;" src="/images/md/monitor/تفاوت-تصاویر-با-فریم-بالا.jpg">
                <p>
                        به تعداد دفعات در ثانیه (برحسب هرتز) که نمایشگر (مانیتور) می‌تواند تصاویر را <b>بروزرسانی</b> کند. یا به عبارتی به <b>تعداد فریم‌هایی</b> (تصاویر) که نمایشگر در یک ثانیه می‌تواند دریافت کند، نرخ بروزرسانی تصاویر یا refresh rate گفته می‌شود. امروزه نمایشگر‌ها معمولا در انواع ۶۰ هرتز (۶۰ فریم در ثاینه) ، ۱۲۰، ۱۴۴ و ۲۴۰ هرتز عرضه می‌شوند.
                </p>
                <p>
                        تعداد فریم‌ها در ثاینه تولید شده <b>هیچ ارتباطی</b> با نرخ بروزرسانی تصاویر ندارد. نرخ بروزرسانی تصاویر در واقع حداکثر تعداد فریم‌ها در ثانیه که توسط مانیتور پشتیبانی می‌شود، را مشخص می‌کند حال آنکه ممکن است یک سیستم تصاویر را با تعداد فریم‌های کمتر در ثانیه در اختیار مانیتور قرار دهد.
                </p>
                <img class="img-responsive" alt="تعداد فریم در ثانیه در مانیتور‌‌ها" style="max-width:230px;" src="/images/md/monitor/تعداد-فریم-ها-در-ثانیه.jpg">
                <p>
                    <span class="glyphicon glyphicon-info-sign"></span>برای تولید ویدیو‌ها و بازی‌ها با تعداد بیشتر فریم در ثانیه به <b><a href="">پردازنده</a></b>، <b>کابل</b> مناسب و از همه مهم‌تر <b><a href="">کارت گرافیک</a> قوی</b> نیاز است.
                </p>
                <h4>فایده خرید مانیتور با نرخ بورزرسانی تصاویر بالا در سیستم با کارت گرافیک ضعیف چست؟</h4>
                <p>
                        صرف نظر از ویژگی‌های دیگر مانیتور‌‌هایی که نرخ بروزرسانی بالا (۱۲۰ هرتز یا بالاتر) دارند، این مانیتور‌ها <b>هیچ گونه تاثیری</b> در بهبود تعداد فریم در ثانیه نخواهد داشت. حال اگر کارت گرافیک نتواند این تعداد فریم (تصویر) در ثانیه (۱۲۰ فریم) تولید کند، مانیتور مجبور می‌شود از <b>فریم‌های تکراری</b> استفاده کند.    
                </p>
                {{--  related links  --}}
                <div id="related-links">

                </div>
                 
                
            </div>
        </div>
    </div>
@endsection