@extends('layouts.app')

@section('title')
انواع اسلات توسعه و تفاوت آن‌ها
@endsection

@section('description')

@endsection

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-sm-3">
                @include('includes.tutorial_side_nav')
            </div>
            
            <div class="col-sm-9 page-content">
                <h3>رزولوشن (Resolution)</h3>
                <p>
                        رزولوشن تصویر یا نمایشگر نشان‌دهنده‌ی <b>کیفیت یک تصویر</b> است و هرچه رزولوشن بیشتر کیفیت تصویر بیشتر و گوشه‌‌های اشکال درون تصویر <b>واضع‌تر</b> می‌باشد.
                </p>
                <img class="img-responsive" alt="مقایسه رزولوشن‌های مختلف" style="max-width:600px;" src="/images/md/monitor/رزولوشن-تصاویر.jpg">
                <p>
                        رزولوشن یک مانیتور (هر نمایشگری دیگر مانند تلویزیون) <b>تعداد پیکسل‌های موجود</b> در آن را مشخص می‌کند. برای مثال رزولوشن 1920x1080 یعنی ۱۹۲۰ پیکسل (عدد سمت چپ) در هر ردیف افقی و ۱۰۸۰ پیکسل (عدد سمت راست) در هر ستون عمودی نمایشگر وجود دارد.
                </p>
                <p>
                    <span class="glyphicon glyphicon-alert"></span>رزولوشن هیچ اطلاعاتی نسبت به <b>اندازه یک نمایشگر</b> را مشخص نمی‌کند. یعنی ممکن است در یک نمایشگر (صفحه موبایل) پیکسل‌ها بسیار کوچک باشند و رزولوشن آن 1920x1080 باشد و همچنین یک مانیتور (برای مثال ۲۴ اینچ) نیز با اندازه <b>پیکسل‌های بزرگتر</b> همین رزولوشن را داشته باشد.
                </p>
                <h4>انواع رزولوشن</h4>
                <p>
                        انواع متداول رزولوشن در زیر معرفی شده است:
                </p>
                <ul class="custom-list">
                    <li><span class="sublist-title">HD :</span>‌ به رزولوشن <b>1280x720</b>، رزولوشن <b>720p</b> یا HD نامیده می‌شود. این رزولوشن در <a href="">نسبت تصویر</a> 16:9 عرضه می‌شود.</li>
                    <li><span class="sublist-title">Full HD :</span> رزولوشن <b>1920x1080</b>، رزولوشن <b>1080p</b> یا FHD نامیده می‌شود. مانیتور‌های Full HD معمولا با نسبت تصاویر 16:9 تولید می‌شوند.</li>
                    <li><span class="sublist-title">Quad-HD :</span> رزولوشن <b>2560x1440</b>، را رزولوشن QHD می‌نامند که <b>چهار برابر</b> رزولوشن HD می‌باشد. نسبت تصویر در این رزولوشن نیز معمولا 16:9 می‌باشد.</li>
                    <li><span class="sublist-title">Ultra HD :</span> رزولوشن <b>3840x2160</b>، یعنی <b>دو برابر</b> رزولوشن 1080p را Ultra HD می‌گویند.</li>
                    <li><span class="sublist-title">4K :</span> در این رزولوشن استاندارد‌ها کمی متفاوت است و به جای تعداد پیکسل‌های عمودی، نام این رزولوشن بر حسب <b>پیکسل‌های افقی</b> نامگذاری شده است. به عبارت دیگر در این رزولوشن ۴۰۰۰ پیکسل در یک ردیف افقی قرار دارند. <b>4096x2160</b> که کمی عریض‌تر از رزولوشن Ultra HD است.</li>
                    <p>
                        <span class="glyphicon glyphicon-zoom-in"></span>همچنین تعداد پیکسل‌ها در رزولوشن <b>2K</b> برابر 2048x1080 و در رزولوشن <b>8K</b> برابر با 7680x4320 می‌باشد.
                    </p>
                </ul>
                {{--  related links  --}}
                <div id="related-links">

                </div>
                 
                
            </div>
        </div>
    </div>
@endsection