@extends('layouts.app')

@section('title')
انواع اسلات توسعه و تفاوت آن‌ها
@endsection

@section('description')

@endsection

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-sm-3">
                @include('includes.tutorial_side_nav')
            </div>
            
            <div class="col-sm-9 page-content">
                <h3>کانکتور پاور فرم ATX</h3>
                <p>
                    کانکتور‌های فرم <a href="">ATX</a> برای اتصال <a href="">پاور</a> به <a herf="">مادربورد</a> استفاده می‌شود. این کانکتور جایگزین کانکتور <a href="">P8/P9</a> نسل قدیم مادربورد‌ها شده است.
                    برای مادربورد های ATX از کانکتور ۲۰ پین یا P1 و برای مادربورد‌های <a href="">ATX-2</a> از کانکتور ۲۴ پین استفاده می‌شود.
                </p>
                <img class="img-responsive" alt="کانکتور ۲۴ پین پاور بروی مادربورد" src="/images/md/motherboard/کانکتور-۲۴-پین-پاور-مادربورد.jpg">
                <p>
                    همانطور که در تصویر مشاهده می‌کنید کابل دارای یک گیره برای ثابت نگه داشتن آن در محل اتصال است. همچنین این کابل فقط در یک جهت به مادربورد متصل می‌شود که به این ویژگی <a href="">Keyed</a> گفته می‌شود.
                </p>
                <img class="img-responsive" alt="کابل ۲۰ پین پاور" src="/images/md/motherboard/کابل-۲۰-پین-پاور.jpg">
                
                <h4>آیا می‌توان از کابل ۲۴ پین را در مادربورد‌ها با کانکتور ۲۰ پین استفاده کرد؟</h4>
                <p>
                        بله، در کابل‌های ۲۴ پین این امکان وجود دارد که ۴ پین انتهایی آن را جدا کنیم و در کانتور‌های  ۲۰ پین براحتی متصل شود. 
                </p>
                <img class="img-responsive" alt="کابل ۲۴ پین پاور" src="/images/md/motherboard/کابل-۲۴-پین-پاور.jpg">
                <p>
                    <span class="glyphicon glyphicon-alert"></span>هنگام اتصال ۴ پین انتهایی کابل ۲۴ پین باید جهت فلش‌های روی کابل به سمت یکدیگر باشند.
                </p>
                <h4>آیا می‌توان از کابل 20 پین را در مادربورد‌ها با کانکتور 24 پین استفاده کرد؟</h4>
                <p>
                        بله، همانطور که در تصویر می‌بینید، شما میتوانید کابل ۲۰ پین را به کانکتور ۲۴ پین متصل کنید و تا زمانی که جریان مورد نیاز مادربورد کم است برای مادربورد خطری ندارد. اما در صورت نیاز به جریان بالا امکان گرم شدن زیاد کابل و کانتور و درنهایت سوختن مادربورد وجود دارد. پس بهتر است در حد امکان از پاور با کابل ۲۴ پین استفاده شود.
                </p>
                <img class="img-responsive" alt="اتصال کابل ۲۰ پین در کانکتور ۲۴ پین" src="/images/md/motherboard/کابل-۲۰-پین-کانکتور-۲۴-پین.jpg">
                
                {{--  related links  --}}
                <div id="related-links">

                </div>
                 
                
            </div>
        </div>
    </div>
@endsection