@extends('layouts.app')

@section('title')
فن‌های کیس کامپیوتر و کانکتور‌های آن‌ها
@endsection

@section('description')
فن‌های کیس کامپیوتر در اندازه‌های متفاوت ۸۰ میلیمتر، ۹۲ میلیمتر و ۱۲۰ میلیمتر وجود دارند | انواع کانکتور‌های اتصال فن‌های کیس
@endsection

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-sm-3">
                @include('includes.tutorial_side_nav')
            </div>
            
            <div class="col-sm-9 page-content">
                <h3>فن کیس</h3>
                <p>
                        فن کیس یا case fan یا system fan در داخل کیس قسمت جلو یا عقب آن قرار می‌گیرد و وظیفه به جریان انداختن هوا درون کیس برای خنک شدن سریعتر اجزای داخل <a href="{{url('tutorial/case/انواع-کیس')}}">کیس</a> مثل <a href="{{url('tutorial/cpu/پردازنده-چیست')}}">پردازنده</a> (cpu) یا <a href="{{url('tutorial/graphic/کارت-گرافیک')}}">کارت گرافیک</a> (video card) را بر عهده دارد.
                </p>
                <p>
                        فن کیس در اندازه‌های متفاوت ۸۰ میلیمتر، ۹۲ میلیمتر و ۱۲۰ میلیمتر وجود دارد.
                </p>
                <img class="img-responsive" alt="فن کیس" src="/images/md/motherboard/فن-کیس.jpg">
                <h4>کانکتور فن <a href="{{url('tutorial/motherboard/مادربورد-چیست')}}">مادربورد</a></h4>
                <ul>
                    سه نوع کانکتور فن عبارت‌اند از:
                    <li>کانکتور ۴ پین <b>large molex</b> که دارای دو سیم مثبت و منفی می‌باشد و مستقیماً به <a href="{{url('tutorial/power_supply/پاور')}}">پاور</a> متصل می‌شود. امکان کنترل سرعت و ولتاژ فن وجود ندارد.</li>
                    <li>کانکتور ۳ پین فن که در آن یک سیم اضافی برای <b>کنترل ولتاژ فن</b> وجود دارد و می‌توان با کننترل ولتاژ سرعت را تغییر داد. </li>
                    <li>کانکتور ۴ پین فن PWM که در مادربورد‌های مدرن وجود دارد، یک کانکتور برای <b>کنترل سرعت فن</b> وجود دارد و معمولا <b>بازده</b> آن بیشتر است.</li>
                </ul>
                <img class="img-responsive" alt="کاکتور‌های فن کیس" src="/images/md/motherboard/کانکتورهای-فن-کیس.jpg">
                <h4>فن مناسب کیس من کدام است؟</h4>
                <p>
                    ابتدا دقت کنید که مادربورد کانکتور فن را ساپورت کند سپس اندازه فن مناسب کیس خود را پیدا کنید؛ برای این منظور فاصله وسط محل دو پیچ فن روی کیس را اندازه بگیرید (نه به صورت <b>قطری</b>) فن مناست کیس شما باید کمی بزرگتر باشد.
                    مثلا اگر فن مناسب ۱۲۰ میلیمتر باشد فاصله محل پیچ‌ها حدود ۱۰۵ میلیمتر می‌باشد
                </p>
                {{--  related links  --}}
                <div id="related-links">

                </div>
                 
                
            </div>
        </div>
    </div>
@endsection