@extends('layouts.app')

@section('title')
انواع اسلات توسعه و تفاوت آن‌ها
@endsection

@section('description')

@endsection

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-sm-3">
                @include('includes.tutorial_side_nav')
            </div>
            
            <div class="col-sm-9 page-content">
                <h3>فن کیس</h3>
                <p>
                        فن کیس یا case fan یا system fan در داخل کیس قسمت جلو یا عقب آن قرار می‌گیرد و وظیفه به جریان انداختن هوا درون کیس برای خنک شدن سریعتر اجزای داخل <a href="">کیس</a> مثل <a href="">پردازنده</a> (cpu) یا <a href="">کارت گرافیک</a> (video card) را بر عهده دارد.
                </p>
                <p>
                        فن کیس در اندازه‌های متفاوت ۸۰ میلیمتر، ۹۲ میلیمتر و ۱۲۰ میلیمتر وجود دارد.
                </p>
                <img class="img-responsive" src="/images/md/motherboard/case_fan.jpg">
                <h4>کانکتور فن <a href="">مادربورد</a></h4>
                <ul>
                    سه نوع کانکتور فن عبارت‌اند از:
                    <li>کانکتور ۴ پین large molex که دارای دو سیم مثبت و منفی می‌باشد و مستقیماً به <a href="">پاور</a> متصل می‌شود. امکان کنترل سرعت و ولتاژ فن وجود ندارد.</li>
                    <li>کانکتور ۳ پین فن که در آن یک سیم اضافی برای کنترل ولتاژ فن وجود دارد و می‌توان با کننترل ولتاژ سرعت را تغییر داد. </li>
                    <li>کانکتور ۴ پین فن PWM که در مادربورد‌های مدرن وجود دارد، یک کانکتور برای کنترل سرعت فن وجود دارد و معمولا بازده آن بیشتر است.</li>
                </ul>
                <img class="img-responsive" src="/images/md/motherboard/fan_connectors.jpg">
                <h4>فن مناسب کیس من کدام است؟</h4>
                <p>
                    ابتدا دقت کنید که مادربورد کانکتور فن را ساپورت کند سپس اندازه فن مناسب کیس خود را پیدا کنید؛ برای این منظور فاصله وسط محل دو پیچ فن روی کیس را اندازه بگیرید (نه به صورت قطری) فن مناست کیس شما باید کمی بزرگتر باشد.
                    مثلا اگر فن مناسب ۱۲۰ میلیمتر باشد فاصله محل پیچ‌ها حدود ۱۰۵ میلیمتر می‌باشد
                </p>
                {{--  related links  --}}
                <div id="related-links">

                </di>
                 
                
            </div>
        </div>
    </div>
@endsection